import Product from '../../shared/types/product';

const products: Product[] = [
  {
    _id: '2',
    images: [
      '/products/clock-1.jpg',
      '/products/clock-2.jpg',
      '/products/clock-3.jpg',
      '/products/clock-4.jpg',
      '/products/clock-5.jpg',
    ],
    title: 'ساعت دیواری',
    price: 75000,
    categories: ['وسایل تزئینی', 'دسته بندی'],
    countInStock: 10,
    intro:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
    info: {
      weight: '2 کیلوگرم',
      dimentions: '2 x 3 x 4',
      colors: 'ابی، سبز، مشکی',
      material: 'چوبی، فلزی',
    },
    reviews: [],
    tags: ['وسایل، خرید وسایل خانگی'],
  },
  {
    _id: '1',
    images: [
      '/products/p-1.jpg',
      '/products/p-2.jpg',
      '/products/p-3.jpg',
      '/products/p-4.jpg',
      '/products/p-5.jpg',
    ],
    title: 'گوزن تزئینی',
    price: 75000,
    categories: ['وسایل تزئینی', 'دسته بندی'],
    countInStock: 10,
    intro:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
    info: {
      weight: '2 کیلوگرم',
      dimentions: '2 x 3 x 4',
      colors: 'ابی، سبز، مشکی',
      material: 'چوبی، فلزی',
    },
    reviews: [],
    tags: ['وسایل، خرید وسایل خانگی'],
  },
  {
    _id: '3',
    images: [
      '/products/table-1.jpg',
      '/products/table-2.jpg',
      '/products/table-3.jpg',
      '/products/table-4.jpg',
      '/products/table-5.jpg',
    ],
    title: 'میز چوبی',
    price: 150000,
    categories: ['وسایل تزئینی', 'دسته بندی'],
    countInStock: 10,
    intro:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
    info: {
      weight: '2 کیلوگرم',
      dimentions: '2 x 3 x 4',
      colors: 'ابی، سبز، مشکی',
      material: 'چوبی، فلزی',
    },
    reviews: [],
    tags: ['وسایل، خرید وسایل خانگی'],
  },
  {
    _id: '4',
    images: [
      '/products/table-1.jpg',
      '/products/table-2.jpg',
      '/products/table-3.jpg',
      '/products/table-4.jpg',
      '/products/table-5.jpg',
    ],
    title: 'میز چوبی',
    price: 150000,
    categories: ['وسایل تزئینی', 'دسته بندی'],
    countInStock: 10,
    intro:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
    info: {
      weight: '2 کیلوگرم',
      dimentions: '2 x 3 x 4',
      colors: 'ابی، سبز، مشکی',
      material: 'چوبی، فلزی',
    },
    reviews: [],
    tags: ['وسایل، خرید وسایل خانگی'],
  },
];

export default products;
